РП/src/InformationRegisters/УдалитьПравилаПолученияФактаПоСтатьямБюджетов/УдалитьПравилаПолученияФактаПоСтатьямБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьПравилаПолученияФактаПоСтатьямБюджетов</name>
  <resources>
    <name>КомпоновщикНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипИтога</name>
    <type>
      <types>EnumRef.ТипыИтогов</types>
    </type>
  </resources>
  <resources>
    <name>ОборотПоАналитикеРасхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СхемаИсточникаДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РасширеныйРежимНастройкиЗаполненияАналитики</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияАналитики1</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияАналитики2</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияАналитики3</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияАналитики4</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияАналитики5</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВыражениеЗаполненияАналитики6</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьУказаннымЗначениемАналитику1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьУказаннымЗначениемАналитику2</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьУказаннымЗначениемАналитику3</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьУказаннымЗначениемАналитику4</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьУказаннымЗначениемАналитику5</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьУказаннымЗначениемАналитику6</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеАналитики1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеАналитики2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеАналитики3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеАналитики4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеАналитики5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеАналитики6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>ПромежуточноеКэшированиеРезультатовРаботыПравил</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДействуетПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтключитьПравило</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>РазделИсточникаДанных</name>
    <type>
      <types>EnumRef.РазделыИсточниковДанныхБюджетирования</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтатьяБюджетов</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникДанных</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
      <types>String</types>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникСуммыОперации</name>
    <type>
      <types>EnumRef.ПоказателиАналитическихРегистров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/Enums/РазделыИсточниковДанныхБюджетирования/РазделыИсточниковДанныхБюджетирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыИсточниковДанныхБюджетирования</name>
  <enumValues>
    <name>ОперативныйУчет</name>
  </enumValues>
  <enumValues>
    <name>РегламентированныйУчет</name>
  </enumValues>
  <enumValues>
    <name>МеждународныйУчет</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
</mdclass:Enum>

РП/src/InformationRegisters/УдалитьПравилаПолученияФактаПоСтатьямБюджетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает схему для получения факта по статьям бюджетов
// 
// Параметры
// 	 Правило - РегистрСведенийМенеджерЗаписи.ПравилаПолученияФактаПоСтатьямБюджетов, Выборка,
// 				СтрокаТаблицыЗначений, Cтруктура - Правило получения факта по статьям бюджетов.
// 
// Возвращаемое значение
// 	 СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - схема получения фактических данных, соответствующая источнику
//
Функция СхемаПолученияДанных(Правило) Экспорт
	
	СхемаПолученияДанных = ФинансоваяОтчетностьСервер.НоваяСхема();
	НаборДанных = ФинансоваяОтчетностьСервер.НовыйНабор(СхемаПолученияДанных);
	НаборДанных.Запрос =
		"ВЫБРАТЬ
		|*";
	
	Если Правило.РазделИсточникаДанных = Перечисления.РазделыИсточниковДанныхБюджетирования.ОперативныйУчет Тогда
		Если ЗначениеЗаполнено(Правило.ИсточникДанных) Тогда
			МакетыИсточниковПолученияДанных = Метаданные.РегистрыСведений.ПравилаПолученияФактаПоСтатьямБюджетов.Макеты;
			ИмяИсточникаДанных = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило.ИсточникДанных, "ИсточникДанных");
			МакетИсточникаПолученияДанных = МакетыИсточниковПолученияДанных.Найти(ИмяИсточникаДанных);
			Если МакетИсточникаПолученияДанных = Неопределено Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Для операции %1 не определена схема получения данных.';uk='Для операції %1 не визначена схема отримання даних.'"), Правило.ИсточникДанных);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			ИмяСхемы = МакетИсточникаПолученияДанных.Имя; 
			СхемаПолученияДанных = РегистрыСведений.ПравилаПолученияФактаПоСтатьямБюджетов.ПолучитьМакет(ИмяСхемы);
		КонецЕсли;
	ИначеЕсли Правило.РазделИсточникаДанных = Перечисления.РазделыИсточниковДанныхБюджетирования.РегламентированныйУчет Тогда
		ИмяСхемы = "РегламентированныйУчет";
		СхемаПолученияДанных = РегистрыСведений.ПравилаПолученияФактаПоСтатьямБюджетов.ПолучитьМакет(ИмяСхемы);
	ИначеЕсли Правило.РазделИсточникаДанных = Перечисления.РазделыИсточниковДанныхБюджетирования.МеждународныйУчет Тогда
		ИмяСхемы = "МеждународныйУчет";
		СхемаПолученияДанных = РегистрыСведений.ПравилаПолученияФактаПоСтатьямБюджетов.ПолучитьМакет(ИмяСхемы);
	ИначеЕсли Правило.РазделИсточникаДанных = Перечисления.РазделыИсточниковДанныхБюджетирования.ПроизвольныеДанные Тогда
		СхемаПолученияДанныхПравила = Правило.СхемаИсточникаДанных.Получить();
		Если СхемаПолученияДанныхПравила <> Неопределено Тогда
			СхемаПолученияДанных = СхемаПолученияДанныхПравила;
		КонецЕсли;
	Иначе
		ВызватьИсключение НСтр("ru='Не определен раздел источника получения данных. Получение схемы невозможно.';uk='Не визначений розділ джерела отримання даних. Отримання схеми неможливо.'");
	КонецЕсли; 
	
	Возврат СхемаПолученияДанных;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти

#КонецЕсли
